{
"youtube": "https://www.youtube.com/",
  "soundcloud": "http://soundcloud.com/stefan-mahendra ",
  "facebook": "https://www.facebook.com/stefanmahendra12 ",
  "bio": "Stefan Mahendra is a South East London bred musician that has established himself as an anomaly amongst the modern-day R&B artist. His love of Soul, R&B, and Motown set the tone for what his career is today. With a polished and refined craft that he has made his own, he continues to push the boundary of his original music. He has a diverse palette of influences including D'Angelo, Marvin Gaye, Donny Hathaway, Stevie Wonder, John Legend.\n\nStefan has toured the world with bands that were opening shows for the likes of world-famous artists such as Sting, Shaggy, Melanie C, and many more. His debut television appearance was made in 2019, when he became a quarter-finalist on The Voice UK 2019. Following his time on The Voice, Stefan and his band BrownSugar went on to support Olly Murs at the O2 Arena London.\n\nWhen Stefan is not creating and recording his original music, he continues to perform all over the world, leaving you with a desire for more of that classic old school sound with a modern twist that appeals to all ages.\n",
  "appleMusic": "https://music.apple.com/us/artist/stefan-mahendra/1458240983",
  "releases": [
    {
      "releaseDescription": "Building on the potential he flashed in his debut single 'Lovin’ You Is Easy', Mahendra’s new crooner is a worthy follow-up. Subtle, simple, and elegant, it’s another shining display of his creative mastery of the R&B and soul genres.",
      "preOrderLink": "",
      "releaseDate": "19.01.2021",
      "releaseName": "Alright",
      "image": "alright-final.jpg",
      "releaseImages": [
        {
          "releaseImage": "alright-final.jpg"
        }
      ],
      "link": "https://orcd.co/sm-alright",
      "trackListing": [
        {
          "trackDuration": "3:44",
          "trackName": "Alright"
        },
        {
          "trackName": "Lovin' You is Easy",
          "trackDuration": "3:56"
        }
      ]
    },
    {
      "releaseDescription": "Stefan Mahendra's debut single. A heartfelt and honest love record that manages to feel uniquely vintage and surprisingly modern at the same time. \n\nHaving been performing for years (you may have seen him as a quarter-finalist on the Voice UK 2019) and only now coming into the nascent stage of his creative and artistic development, Mahendra displays unmistakable and impressive potential in his debut single. 'Lovin’ You Is Easy' is a masterful exhibit of modern R&B, harkening back to the era of soul and jazz music.",
      "preOrderLink": "",
      "releaseDate": "17.11.2020",
      "link": "https://orcd.co/lovinyouiseasy",
      "image": "lovin-you-is-easy-packshot.jpg",
      "releaseImages": [
        {
          "releaseImage": "lovin-you-is-easy-packshot.jpg"
        }
      ],
      "trackListing": [
        {
          "trackName": "Loving You is Easy",
          "trackDuration": "3:56"
        }
      ],
      "releaseName": "Lovin' You is Easy"
    },
    {
      "releaseDescription": "Feels So Good is an irresistible and aptly titled jam that grooves between the lines of contemporary r&b and the genre classics of the early 00’s. Although just his third original song, this self-produced track marks yet another notch on the belt for Mahendra, who has long-proven himself as a performer across London and beyond.",
      "preOrderLink": "",
      "releaseDate": "25.05.2021",
      "releaseName": "Feels So Good",
      "link": "orcd.co/feelssogood",
      "trackListing": [
        {
          "trackName": "Feels So Good",
          "trackDuration": "3:25"
        }
      ],
      "releaseImages": [
        {
          "releaseImage": "nurt035_low.jpg"
        }
      ]
    }
  ],
  "artistName": "Stefan Mahendra",
  "instagram": "https://www.instagram.com/stefanmahendramusic ",
  "twitter": "https://twitter.com/stefan_mahendra",
  "tiktok": "",
  "spotify": "https://open.spotify.com/artist/17lfIZ8ozwR7vDYqRdr8UF",
  "website": "stefanmahendra.com",
  "image": "img_0748-1-.jpg"
}
