{
"soundcloud": "https://soundcloud.com/yianna-music",
  "facebook": "https://www.facebook.com/yiannamusic",
  "bio": "Originally from New Jersey, Yianna began singing in high school after entering a talent show on a whim. With no true sense of direction what to do after high school, she initially had planned to enroll in the military but was later heard by local music producers and encouraged to start writing songs. \n\nAfter enrolling in a local community college to major in computer science, Fran dropped out after one semester and moved to New York City to pursue music. After spending time writing for other artists and performing as a backup singer on shows like \"Good Morning America\", she knew she wanted to pursue her own artist career. Knowing nothing or no one in music, she began gigging all over new york - train stations, cafes, bar's - anywhere she could practice performing live.\n",
  "appleMusic": "https://music.apple.com/us/artist/yianna/1441120929",
  "releases": [
    {
      "releaseDescription": "Class of 1995 was recorded primarily in a basement studio in Brooklyn with a variety of musicians and producers within Yianna's local community making appearances across the tracklist. The end result was recorded using almost exclusively live instruments. Noting jazz, 90's hip hop, and motown as heavy influences, the Class of 1995 is lyrically unfiltered and highlights the feeling of being rejected, and ultimately finding self-acceptance.\n",
      "preOrderLink": "",
      "releaseDate": "17.07.2020",
      "releaseName": "Class of 1995",
      "image": "class-of-1995-1-.jpeg",
      "link": "https://ffm.to/co1995",
      "trackListing": [
        {
          "trackName": "Big Tittier Girl",
          "trackDuration": "3:20"
        },
        {
          "trackName": "Groove With You",
          "trackDuration": "3:57"
        },
        {
          "trackName": "Mom & Dad",
          "trackDuration": "3:43"
        },
        {
          "trackName": "When I'm Loving You",
          "trackDuration": "3:46"
        },
        {
          "trackName": "Crazy",
          "trackDuration": "3:53"
        },
        {
          "trackName": "Out of the Box",
          "trackDuration": "3:14"
        },
        {
          "trackDuration": "2:50",
          "trackName": "Some Girls"
        },
        {
          "trackName": "1-800-Superhorny",
          "trackDuration": "3:25"
        },
        {
          "trackName": "Before the Internet",
          "trackDuration": "2:02"
        }
      ]
    },
    {
      "releaseDescription": "Filled with dreamy soundscapes and lulling guitar melodies, “When I’m Loving You” showcases Yianna’s vocal talent, her powerful voice sweeping across the musical canvas. On the set of a 90s prom, the students sway across the softly lit dance floor, surrounded by plumes of iridescent ribbons and intoxicated by the sparks of teenage romance.",
      "preOrderLink": "",
      "releaseDate": "28.04.2020",
      "releaseName": "When I'm Loving You",
      "image": "when-i-m-loving-you.jpg",
      "link": "https://ffm.to/yianna_wily",
      "trackListing": [
        {
          "trackName": "When I'm Loving You",
          "trackDuration": "3:46"
        }
      ]
    },
    {
      "releaseDescription": "Conceptualized during an LA trip in 2018, without realizing it, Yianna had quickly written a song that clearly reflected what she was going through at the time with a particular personal relationship. Her time spent in LA didn’t live up to her glamorous expectations - and the majority of it was spent in isolation and coming to terms with her close friend choosing his vices instead of his friendship.\n",
      "preOrderLink": "",
      "releaseDate": "12.07.2019",
      "releaseName": "Hard Pill to Swallow",
      "link": "http://smarturl.com/yianna-hpts",
      "trackListing": [
        {
          "trackName": "Hard Pill to Swallow",
          "trackDuration": "3:02"
        }
      ],
      "image": "yianna_hpts.jpg"
    },
    {
      "releaseDescription": "Drawing influences from alt-rock, pop, R&B and soul, Heavy Waters is completely unrestricted by traditional genre boundaries. There is a raw vulnerability to Yianna's music that is wise beyond her years; she taps into a soulful energy that is often absent from today's mainstream hits. Marked by sultry vocals, laidback R&B stylings, and catchy melodies, the song takes the listener on a uniquely picturesque journey,",
      "preOrderLink": "",
      "releaseDate": "14.06.2019",
      "releaseName": "Heavy Waters",
      "link": "http://smarturl.it/heavy_waters",
      "trackListing": [
        {
          "trackName": "Heavy Waters",
          "trackDuration": "3:42"
        }
      ],
      "image": "yianna_hw_artwork.jpg"
    }
  ],
  "artistName": "Yianna",
  "instagram": "https://www.instagram.com/yianna",
  "twitter": "https://twitter.com/yiannamusic",
  "tiktok": "https://www.tiktok.com/@yiannamusic",
  "spotify": "https://open.spotify.com/artist/051lz9ZMNShdpFP1uQtd9m",
  "website": "https://www.yiannamusic.com/",
  "image": "yianna_brooklyn_-3.jpeg"
}
