{
"soundcloud": "https://soundcloud.com/zulidude ",
  "facebook": "https://www.facebook.com/zulidude",
  "bio": "Sitting in your pocket, on your screen, and in your home, one monolithic brand listens in, makes “suggestions,” and subconsciously informs the world around you. It lies in the background only to entirely shape the foreground. Sound familiar? \n\nWe needn’t cite any real-life names as we know they’re probably listening, but this idea remains the crux of Zuli Jr.’s Stop It God., due May ’21. In his case, Daisy serves as the ever-present corporate overlord with a HAL 9000-style computer to navigate daily life. Crafting a story of his own, the New York singer, songwriter, and alternative R&B insurgent opens up a worm hole between future-facing pop, Platonic allegory, science fiction, and eerily parallel truths. \n",
  "appleMusic": "https://music.apple.com/us/artist/zuli-jr/1092360946",
  "releases": [
    {
      "releaseDescription": "The first single from Zuli Jr.'s sophomore album - 'Stop it God.'. Sunny production and a steady beat strut underneath his dynamic vocal performance, fluttering from intimate verses into fiery falsetto.\n\n\"How to Feel is about examining the ego from the outside looking in and how that affects the people around you. This is easily one of my favorite songs on the record and feels like the perfect transition from one chapter to the next.” - Zuli",
      "preOrderLink": "https://orcd.co/howtofeel",
      "releaseDate": "22.01.2021",
      "releaseName": "How to Feel",
      "image": "how-to-feel-single-art-final.jpg",
      "link": "https://orcd.co/howtofeel",
      "trackListing": [
        {
          "trackName": "How to Feel",
          "trackDuration": "3:26"
        }
      ]
    }
  ],
  "artistName": "Zuli Jr.",
  "instagram": "https://www.instagram.com/zuli_jr",
  "twitter": "https://twitter.com/zuli_jr",
  "tiktok": "https://www.tiktok.com/@zuli_jr",
  "spotify": "https://open.spotify.com/artist/01O6qxIrBMxnALWGgrKmJW",
  "website": "https://www.zuli-jr.com/",
  "image": "1-felton-kizer-1-.jpg"
}
